In [54]:
import pandas as pd

In [56]:
df = pd.read_csv(r'C:\Users\USER\Downloads\titanic.csv')
df.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [59]:
dfd = df.drop(['PassengerId','Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns')

In [61]:
dfd.head(8)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500
5         0       3    male   NaN   8.4583
6         0       1    male  54.0  51.8625
7         0       3    male   2.0  21.0750

In [66]:
dfd.Age = dfd.Age.fillna(dfd.Age.mean())

In [67]:
dfd.head(8)

   Survived  Pclass     Sex        Age     Fare
0         0       3    male  22.000000   7.2500
1         1       1  female  38.000000  71.2833
2         1       3  female  26.000000   7.9250
3         1       1  female  35.000000  53.1000
4         0       3    male  35.000000   8.0500
5         0       3    male  29.699118   8.4583
6         0       1    male  54.000000  51.8625
7         0       3    male   2.000000  21.0750

In [68]:
dfd.Sex = dfd.Sex.map({'male':1, 'female':2})

WE CAN ALSO USE LabelEncoder for line 68

In [70]:
dfd.head(8)

   Survived  Pclass  Sex        Age     Fare
0         0       3    1  22.000000   7.2500
1         1       1    2  38.000000  71.2833
2         1       3    2  26.000000   7.9250
3         1       1    2  35.000000  53.1000
4         0       3    1  35.000000   8.0500
5         0       3    1  29.699118   8.4583
6         0       1    1  54.000000  51.8625
7         0       3    1   2.000000  21.0750

In [71]:
from sklearn.model_selection import train_test_split

In [72]:
X = dfd.drop(['Survived'], axis = 'columns')
X.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [73]:
y=dfd.Survived

In [74]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [85]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [86]:
len(X_train)

712

In [87]:
len(X_test)

179

In [88]:
from sklearn.tree import DecisionTreeRegressor

In [89]:
model = DecisionTreeRegressor()

In [90]:
model.fit(X_train, y_train)

DecisionTreeRegressor()

In [91]:
model.score(X_test, y_test)

0.2627389037929483

In [92]:
model.predict([[1,1,54.000000,51.8625]])

C:\ProgramData\anaconda3\lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but DecisionTreeRegressor was fitted with feature names
  warnings.warn(

array([0.])